---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.End
source: html/fe010c03-172a-180d-6015-f412e2e390c9.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.End Method

Checks if the network iteration has completed.

## Syntax (C#)
```csharp
public bool End()
```

## Returns
True if all analytical segments and nodes have been visited, otherwise false.